#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h> 
#include <stdlib.h>

////////////////////////////////////////////
// 1. 求两个整数的平均值
////////////////////////////////////////////
//int main() {
//	// printf("hehe\n");
//	int a = 10 * 10000 * 10000;
//	int b = 20 * 10000 * 10000;
//	// 方案 1 
//	// int ret = (a + b) / 2;
//	// 方案 2
//	int ret = a + (b - a) / 2;
//	printf("%d\n", ret);
//	system("pause");
//	return 0;
//}

////////////////////////////////////////////
// 2. 交换两个整数变量
////////////////////////////////////////////
//int main() {
//	int a = 10;
//	int b = 20;
//
//	// 方案1
//	//int tmp = a;
//	//a = b;
//	//b = tmp;
//
//	// 方案2 不允许创建临时变量. 溢出的问题~~
//	//a = a + b;	// 30  20
//	//b = a - b;  // 30  10
//	//a = a - b;  // 20  10
//
//	// 方案3 不允许创建临时变量. 按二进制位异或, 不需要进位, 不会溢出
//	// 01010  b
//	// 10100  a
//	// 11110  
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//
//	printf("%d %d\n", a, b);
//	system("pause");
//	return 0;
//}

////////////////////////////////////////////
// 写一个关机程序. 程序运行将在一分钟后关机
// 如果输入 "我是猪" 则取消关机
////////////////////////////////////////////

int main() {
	system("shutdown -s -t 600");

	char input[1024] = { 0 };
AGAIN:
	printf("您的电脑将在 1 分钟内关机. 输入 我是猪 取消关机: ");
	scanf("%s", input);
	if (strcmp(input, "我是猪") == 0) {
		printf("关机被取消!\n");
		system("shutdown -a");
	} else {
		goto AGAIN;
	}
	
	system("pause");
	return 0;
}